// lib/constants/regions.dart

const Map<String, List<String>> saudiRegions = {
  'الرياض': ['الرياض', 'الخرج', 'الدوادمي', 'المزاحمية', 'القويعية', 'الدرعية', 'الزلفي', 'شقراء', 'حوطة بني تميم'],
  'مكة المكرمة': ['جدة', 'مكة', 'الطائف', 'القنفذة', 'الليث', 'رابغ', 'الجموم', 'خليص'],
  'المدينة المنورة': ['المدينة المنورة', 'ينبع', 'العلا', 'بدر', 'خيبر', 'الحناكية'],
  'الشرقية': ['الدمام', 'الأحساء', 'الخبر', 'الجبيل', 'القطيف', 'حفر الباطن', 'رأس تنورة', 'الخفجي'],
  'عسير': ['أبها', 'خميس مشيط', 'بيشة', 'النماص', 'محايل عسير', 'تنومة'],
  'تبوك': ['تبوك', 'ضباء', 'تيماء', 'الوجه', 'حقل'],
  'حائل': ['حائل', 'بقعاء'],
  'الحدود الشمالية': ['عرعر', 'رفحاء', 'طريف'],
  'جازان': ['جازان', 'صبيا', 'صامطة', 'أبو عريش'],
  'نجران': ['نجران', 'شرورة'],
  'الباحة': ['الباحة', 'بلجرشي', 'المندق'],
  'الجوف': ['سكاكا', 'دومة الجندل', 'القريات'],
  'القصيم': ['بريدة', 'عنيزة', 'الرس', 'البكيرية'],
};